Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཚུལ་ཁྲིམས་ངན་པའི་སེམས་སྤང་བར་འདོད་པ་དང་། གནོད་པར་སེམས་པའི་ཡིད་དོར་བར་འདོད་པ་དང་། ལེ་ལོའི་སེམས་དང་། འཁྲུག་པའི་སེམས་དང་། ཤེས་རབ་འཆལ་པའི་སེམས་མི་སྐྱེད་པར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to have states of mind unimpeded with respect to generosity, those who wish to abandon states of mind of poor morality, those who wish to reject malicious states of mind, and those who wish that indolent states of mind, agitated states of mind, and deluded states of mind might not arise should all train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་ཐམས་ཅད་སྦྱིན་པ་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་ལ་དགོད་པར་འདོད་པ་དང་། ཚུལ་ཁྲིམས་ལས་བྱུང་བ་དང་། བསྒོམས་པ་ལས་བྱུང་བ་དང་། རིམ་གྲོ་ལས་བྱུང་བ་དང་། དངོས་པོ་ཐམས་ཅད་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་ལ་དགོད་པར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to establish all beings in the meritorious foundations that arise from generosity, and those who wish to establish them in the meritorious foundations that arise from ethical discipline, {Dt.30} that arise from meditation, that arise from service, and that arise from all material phenomena, should train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མིག་ལྔ་རྣམ་པ་ཐམས་ཅད་དུ་ཡོངས་སུ་བསྒྲུབ་པར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །འདི་ལྟ་སྟེ།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to develop the five eyes in their entirety should train in the perfection of wisdom.

source: ཤའི་མིག་དང་། ལྷའི་མིག་དང་། ཤེས་རབ་ཀྱི་མིག་དང་། ཆོས་ཀྱི་མིག་དང་། སངས་རྒྱས་ཀྱི་མིག་ཡོངས་སུ་བསྒྲུབ་པར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་ཅིག་བཞུགས་པ་དེ་དག་ཐམས་ཅད་དང་ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་།
en: That is to say, those who wish to develop the eye of flesh, the eye of divine clairvoyance, the eye of wisdom, the eye of the Dharma, and the eye of the buddhas should train in the perfection of wisdom. “

source: ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཇི་སྙེད་ཅིག་བཞུགས་པ་དེ་དག་ཐམས་ཅད་ལྷའི་མིག་གིས་བལྟ་བར་འདོད་པ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཆོས་གང་སྟོན་པ་དེ་ཐམས་ཅད་ལྷའི་རྣ་བས་མཉན་པར་འདོད་པ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཐུགས་སེམས་ཀྱིས་ཁོང་དུ་ཆུད་པར་འདོད་པ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་སྔོན་གྱི་སྦྱོར་བ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྗེས་སུ་དྲན་པར་འདོད་པ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་རྫུ་འཕྲུལ་དང་། རྣམ་པར་འཕྲུལ་པ་རྣམ་པ་མང་པོ་མཐོང་བར་འདོད་པས།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to behold with the eye of divine clairvoyance all the lord buddhas, as many as there are who reside in the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, and all the lord buddhas, as many as there are who reside in the world systems of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, as well as in the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā; those who wish to hear with the ear of divine clairaudience all the Dharmas that those lord buddhas are teaching; and those who wish to comprehend the minds of those lord buddhas, who wish to recollect the bodhisattva conduct in which those lord buddhas had formerly engaged, and who wish to behold the manifold miraculous and emanational abilities of those lord buddhas should all train in the perfection of wisdom. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཕྱོགས་བཅུ་ཀུན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་ཆོས་གང་སྟོན་པ་དེ་དག་ཐམས་ཅད་དྲན་པའི་སྟོབས་དང་ཤུགས་གཅད་དུ་མི་ཆོད་པས་ཡང་དག་པར་གཟུང་བར་འདོད་པ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་དེ་ཐམས་ཅད་ཆུད་མི་ཟ་བར་བྱ་བར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འདས་པ་དང་མ་བྱོན་པ་དང་ད་ལྟར་བྱུང་བ་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་དང་།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to retain all the Dharmas that those lord buddhas are teaching in the world systems of all the ten directions, through the uninterrupted power and force of recollection, and those who wish not to squander all these teachings until they have attained consummate buddhahood in unsurpassed, complete enlightenment, should train in the perfection of wisdom. “

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་མང་པོ་མཐོང་བར་འདོད་པ་དང་ཡོངས་སུ་བསྒྲུབ་པར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་མདོ་དང་། དབྱངས་ཀྱིས་བསྙད་པ་དང་། ལུང་བསྟན་པ་དང་། ཚིགས་སུ་བཅད་པ་དང་། ཆེད་དུ་བརྗོད་པ་དང་། གླེང་གཞི་དང་། འདི་ལྟར་འདས་པ་དང་།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to behold and who wish to attain the buddhafields of the lord buddhas of the past, future, {Dt.31} and present, along with many pure lands, should train in the perfection of wisdom. “

source: སྐྱེས་པའི་རབས་དང་། ཤིན་ཏུ་རྒྱས་པ་དང་། རྟོགས་པ་བརྗོད་པ་དང་། གཏན་ལ་དབབ་པར་བསྟན་པ་དང་། ཆོས་རྨད་དུ་བྱུང་བ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་མ་ཐོས་པ་གང་ཇི་བསྟན་ཀྱང་རུང་སྟེ། དེ་དག་ཐམས་ཅད་ཐོས་པར་འདོད་པ་དང་། གཟུང་བར་འདོད་པ་དང་། བཅང་བར་འདོད་པ་དང་། ཀླག་པར་འདོད་པ་དང་། ཡོངས་སུ་ཆུབ་པར་བྱ་བར་འདོད་པ་དང་། མ་ནོར་བར་ནན་ཏན་དུ་བྱ་བར་འདོད་པ་དང་། གཞན་ལ་ཡང་རྒྱ་ཆེར་བསྟན་པར་འདོད་པ་དང་། ཡང་དག་པར་བསྟན་པར་འདོད་པས།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to hear all the teachings whatsoever of the tathāgatas, even those that cannot be heard by śrāvakas or pratyekabuddhas, including the discourses, the sayings in prose and verse, the prophetic declarations, the verses, the aphorisms, the contexts, the quotations, the tales of past lives, the most extensive teachings, the narratives, the established instructions, and the marvelous events, and those who wish to take them up, who wish to uphold them, who wish to recite them, who wish to master them, who wish to apply them earnestly and without error, who wish to teach them extensively to others, and who wish to teach them in an authentic manner, should train in the perfection of wisdom. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤར་ཕྱོགས་སུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱི་གསུངས་པ་དང་གསུང་བ་དང་། གསུང་བར་འགྱུར་བ་དང་། དེ་བཞིན་དུ་ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་འོག་དང་སྟེང་གི་ཕྱོགས་སུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱིས་གསུངས་པ་དང་གསུང་བ་དང་གསུང་བར་འགྱུར་བ་གང་ཅི་ཡང་རུང་སྟེ། དེ་ཐམས་ཅད་མཉན་པར་འདོད་པ་དང་། གཟུང་བར་འདོད་པ་དང་། བཅང་བར་འདོད་པ་དང་། ཀླག་པར་འདོད་པ་དང་། ཡོངས་སུ་ཆུབ་པར་བྱ་བར་འདོད་པ་དང་། གཞན་ལ་ཡང་དག་པར་རྒྱ་ཆེར་བསྟན་པར་འདོད་པ་དང་།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to hear all the teachings whatsoever that all the lord buddhas have spoken, will speak, and are speaking in the eastern direction—and that all the lord buddhas likewise have spoken, will speak, and are speaking in the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, as well as in the nadir and the zenith—and those who wish to take them up, who wish to uphold them, who wish to recite them, who wish to master them, who wish to teach them extensively to others, and who wish to apply them earnestly and without error, should all train in the perfection of wisdom. “

source: དེ་ལ་ཡང་མ་ནོར་བར་ནན་ཏན་དུ་བྱ་བར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། མུན་པ་མུན་ནག་སྨག་ཏུ་གྱུར་པ། སྨག་གིས་ཁྱབ་པ། ཉི་མ་དང་ཟླ་བ་འདི་ལྟར་རྫུ་འཕྲུལ་ཆེ་ཞིང་འདི་ལྟར་གཟི་བརྗིད་ཆེ་ལ། འདི་ལྟར་མཐུ་ཆེ་བ་གཉིས་ཀྱིས་ཀྱང་ལྷམ་མེར་མི་རུང་། ལྷན་ནེར་མི་རུང་།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to illuminate all the places in the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, that are shrouded in darkness, a blinding darkness where even the sun and the moon with such great miraculous capacity, such great splendor, and such great power cannot shine, cannot radiate, and cannot shed light, should train in the perfection of wisdom.

source: ལྷང་ངེར་མི་རུང་བ་དེ་ལྟ་བུ་ཐམས་ཅད་སྣང་བར་བྱ་བར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །དེ་བཞིན་དུ་ལྷོ་དང་ནུབ་དང་བྱང་དང་། བྱང་ཤར་དང་ཤར་ལྷོ་དང་། ལྷོ་ནུབ་དང་། ནུབ་བྱང་དང་། འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། མུན་པ་མུན་ནག་སྨག་དུ་གྱུར་པ། སྨག་གིས་ཁྱབ་པ། ཉི་མ་དང་ཟླ་བ་འདི་ལྟར་རྫུ་འཕྲུལ་ཆེ་ཞིང་། འདི་ལྟར་གཟི་བརྗིད་ཆེ་ལ། འདི་ལྟར་མཐུ་ཆེ་བ་གཉིས་ཀྱིས་ཀྱང་ལྷམ་མེར་མི་རུང་། ལྷན་ནེར་མི་རུང་།
en: Those who wish likewise to illuminate all the places in the world systems of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, as well as in the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, that are shrouded in darkness, a blinding darkness where even the sun and the moon with such great miraculous capacity, such great splendor, and such great power cannot shine, cannot radiate, and cannot shed light, should train in the perfection of wisdom. “

source: ལྷང་ངེར་མི་རུང་བ་དེ་ལྟ་བུ་ཐམས་ཅད་སྣང་བར་བྱ་བར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་ཇི་སྙེད་པ་གང་དུ་སངས་རྒྱས་ཀྱི་སྒྲ་དང་ཆོས་ཀྱི་སྒྲ་དང་དགེ་འདུན་གྱི་སྒྲ་སེམས་ཅན་རྣམས་ཀྱིས་མི་ཐོས་པ་དེ་ལྟ་བུའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ཏུ་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱིས། སངས་རྒྱས་དང་ཆོས་དང་དགེ་འདུན་གྱི་སྒྲ་ཐོས་པར་བྱ་བར་འདོད་པ་དང་། ཡང་དག་པའི་ལྟ་བ་ལ་དགོད་པར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish that all beings in the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, who do not hear the word Buddha, the word Dharma, or the word Saṅgha might hear the word Buddha, the word Dharma, and the word Saṅgha, and those who wish to establish them in the genuine view, should train in the perfection of wisdom.

source: །དེ་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་། ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་ཇི་སྙེད་པ་གང་དུ། སངས་རྒྱས་ཀྱི་སྒྲ་དང་ཆོས་ཀྱི་སྒྲ་དང་དགེ་འདུན་གྱི་སྒྲ་སེམས་ཅན་རྣམས་ཀྱིས་མི་ཐོས་པ་དེ་ལྟ་བུའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ཏུ་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱིས་སངས་རྒྱས་དང་ཆོས་དང་དགེ་འདུན་གྱི་སྒྲ་ཐོས་པར་བྱ་བར་འདོད་པ་དང་། ཡང་དག་པའི་ལྟ་བ་ལ་དགོད་པར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Bodhisattva great beings who likewise wish that all beings in the world systems of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, as well as in the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, who do not hear the word Buddha, the word Dharma, or the word Saṅgha might hear the word Buddha, the word Dharma, and the word Saṅgha, and those who wish to establish them in the genuine view, should train in the perfection of wisdom. {

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤར་ཕྱོགས་དང་། ལྷོ་དང་ནུབ་དང་བྱང་དང་། བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སེམས་ཅན་ལོང་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་བདག་གི་མཐུས། མིག་གིས་གཟུགས་མཐོང་བ་དང་།
en: Dt.32} “Moreover, Śāradvatīputra, when bodhisattva great beings have the thought, ‘Through my power, may beings who are blind, as many as there are in all world systems of the eastern direction, and of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, as well as in the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, see sights with their eyes.

source: འོན་པ་རྣམས་རྣ་བས་སྒྲ་ཐོས་པ་དང་།
en: May those who are deaf hear sounds with their ears!

source: སྨྱོན་པ་རྣམས་དྲན་པ་ཐོབ་པ་དང་།
en: May those who are insane regain their wits!

source: གོས་མེད་པ་རྣམས་གོས་ཐོབ་པ་དང་།
en: May those who are naked obtain clothes!

source: བཀྲེས་པ་དང་སྐོམ་པ་རྣམས་ཟས་དང་སྐོམ་ཐོབ་པ་དང་།
en: May those who are hungry and thirsty obtain food and drink!

source: ནད་པ་རྣམས་ནད་འཚོ་བར་འགྱུར་བ་དང་།
en: May those who are ill recover their health!

source: བཙོན་ར་དང་ཁྲི་མོན་ན་འཁོད་པ་རྣམས་བདག་གིས་རྫུ་འཕྲུལ་དང་བདག་གི་མཐུས་དགའ་མགུར་འདོང་དུ་ཡོད་པར་བྱའོ་སྙམ་ན་ཡང་།
en: May those who are imprisoned and confined in dungeons become joyful!’

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཇི་ལྟར་ན་ཕྱོགས་བཅུ་ཀུན་གྱི་ཕྱོགས་རེ་རེའི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སེམས་ཅན་མི་ཁོམ་པ་དང་། ངན་སོང་དུ་ལྷུང་པ་སེམས་ཅན་དམྱལ་བ་པའམ། བྱོལ་སོང་གི་སྐྱེ་གནས་པའམ། གཤིན་རྗེའི་འཇིག་རྟེན་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་བདག་གིས་མཐུས།
en: then they should train in the perfection of wisdom. “

source: དེ་ནས་ཤི་འཕོས་ནས་མིའི་ལུས་ཐོབ་པར་བྱ་སྙམ་སྟེ། སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཚུལ་ཁྲིམས་ལ་དགོད་པར་འདོད་པ་དང་ཏིང་ངེ་འཛིན་དང་ཤེས་རབ་དང་རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ལ་དགོད་པར་འདོད་པ་དང་། རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་།
en: When bodhisattva great beings wish to establish all beings in ethical discipline, wish to establish them in meditative stability, wisdom, liberation, and seeing the wisdom of liberation, and wish to establish them in the fruit of entering the stream to nirvāṇa, in the fruit of being destined for only one more rebirth, in the fruit of no longer being subject to rebirth, and in arhatship, individual enlightenment, and unsurpassed, complete enlightenment, thinking how, through their power, all those beings, as many as there are in all world systems of each of the ten directions, numerous as the grains of sand of the river Gaṅgā, who are in states that lack freedom, who have fallen into the lower realms, who have been reborn as denizens of the hells, as animals, or in the worlds of Yama, will pass away from those states and, having transmigrated, obtain a human body, at that time they should train in the perfection of wisdom. “

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་དགོད་པར་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ལམ་ལ་བསླབ་པར་འདོད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྤྱོད་པ་དང་། ཚུལ་རྣམ་པར་དག་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུའི་ཕྲིན་ལས་དང་གསུང་གི་ཕྲིན་ལས་དང་ཐུགས་ཀྱི་ཕྲིན་ལས་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བ་ཡོངས་སུ་དག་པ་ལ་བསླབ་པར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to train in the conduct of the tathāgatas, and who wish to train in the enlightened activities of the tathāgatas’ body, the enlightened activities of their speech, and the enlightened activities of their mind, which are pure and preceded by wisdom, should train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ་འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཇི་ལྟར་ན་བདག་གིས་གླང་པོ་ཆེན་པོའི་ལྟ་སྟངས་ཀྱིས་བལྟས་ཏེ། སེམས་ཅན་རྣམས་ལ་ཐོགས་པ་མེད་པར་ཆོས་བསྟན་པར་འགྱུར།
en: Moreover, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, they should think, {Dt.33} ‘How is it that I shall adopt the way that an elephant gazes and teach the Dharma unimpededly to beings?

source: ཇི་ལྟར་ན་བདག་སེང་གེ་ཆེན་པོའི་རྣམ་པར་བསྒྱིངས་པས་རྣམ་པར་སྒྱིང་བར་འགྱུར།
en: How is it that I shall yawn by means of the meditative stability of the yawning of the great lion?

source: ཇི་ལྟར་ན་བདག་གིས་དོན་ཡོད་པའི་རྣམ་པར་གནས་པས་རྣམ་པར་གནས་པར་བྱ།
en: How is it that I shall step with steps that are purposeful?

source: ཇི་ལྟར་ན་བདག་ས་ཆེན་པོ་ལ་སོར་བཞི་ཙམ་གྱིས་རྐང་པས་མི་རེག་པར་འགྲོ་བར་འགྱུར།
en: How is it that I shall move around with my feet not touching the earth, but above it by some four finger-widths?

source: ཇི་ལྟར་ན་བདག་གིས་པད་མོ་འདབ་མ་སྟོང་དང་ལྡན་པ་ལ་རྐང་པ་གཉིས་ཀྱི་མཐིལ་གཞག་ཅིང་། རྐང་པའི་འོག་ན་གནས་པའི་སྲོག་ཆགས་རྣམས་ལ་མི་གནོད་པར་འགྲོ་བར་བྱ།
en: How is it that by placing the soles of my feet on thousand-petaled lotuses, I shall move around without harming the living creatures that are present below my feet?

source: ཇི་ལྟར་ན་བདག་རྐང་པའི་མཐིལ་འཁོར་ལོའི་རྩིབས་སྟོང་དང་ལྡན་པ་གཉིས་ཀྱིས་ས་ཆེན་པོ་ལ་རྣམ་པར་བྲིས་ཏེ་འགྲོ་བར་འགྱུར།
en: How is it that, as I move around, both my feet, their soles endowed with the motif of thousand-spoked wheels, will leave prints on the earth?

source: ཇི་ལྟར་ན་བདག་ས་ཆེན་པོ་ལ་འཁོར་ཀུན་དུ་འཁོར་ལོ་ཙམ་གྱི་ཁྱོན་ཡོངས་སུ་བསྐོར་ཅིང་འཆགས་ན་འཆག་པར་འགྱུར།
en: How is it that I shall walk on the walking path in a circle the size of a wheel while encircling the whole earth?

source: ཇི་ལྟར་ན་བདག་ས་ཆེན་པོ་ཐམས་ཅད་དུ་རྒྱུ་ཞིང་སོང་ཡང་། སའི་རྡུལ་གྱིས་མི་གོས་པར་འགྱུར།
en: How is it that I shall be unsullied by the dust of the earth even though I move about all over the earth?

source: ཇི་ལྟར་ན་བདག་དཔག་ཚད་གཅིག་གམ་གཉིས་སམ་གསུམ་འམ་བཞི་འམ་ལྔ་འམ་བཅུ་འམ་ཉི་ཤུ་འམ་སུམ་ཅུ་འམ་བཞི་བཅུ་འམ་ལྔ་བཅུ་འམ་དཔག་ཚད་བརྒྱ་འམ་དཔག་ཚད་སྟོང་ངམ་དཔག་ཚད་བརྒྱ་ཕྲག་སྟོང་ནས་དཔག་ཚད་ཚད་མེད་པའམ་གྲངས་མེད་པ་འམ། བསམ་གྱིས་མི་ཁྱབ་པའམ། མཚུངས་པ་མེད་པའམ། མཐའ་ཡས་པའམ། ཀུན་དུ་མཐའ་ཡས་པའམ། གཞལ་དུ་མེད་པའམ། བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་གྱི་སངས་རྒྱས་ཀྱི་ཞིང་དག་ཏུ་རྒྱུས་ཏེ་སོང་ཡང་།
en: How is it that I shall be without physical or mental tiredness even though I move through buddhafields measuring one yojana, or two, three, four, five, ten, twenty, thirty, forty, fifty, or one hundred yojanas, or one thousand yojanas, or anything from a hundred thousand yojanas up to immeasurable, countless, inconceivable, incomparable, infinite, completely infinite, unappraisable, indescribably many indescribable numbers of yojanas?’

source: ལུས་དང་སེམས་ལ་དུབ་པ་མེད་པར་འགྱུར་སྙམ་ན་ཡང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: While having such thoughts, they should train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཇི་ལྟར་ན་བདག་གིས་རྐང་པའི་མཐིལ་འཁོར་ལོའི་རྩིབས་སྟོང་དང་ལྡན་པ་གཉིས་ནས་འོད་ཟེར་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་བཀྱེ་སྟེ། མི་ཁོམ་པ་དང་ངན་སོང་གི་སྡུག་བསྔལ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱས་ནས། སེམས་ཅན་ཐམས་ཅད་བདེ་བར་བྱ་བར་འགྱུར་སྙམ་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ་འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཇི་ལྟར་ན་བདག་རྒྱལ་པོ་ཆེན་པོ་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་དང་། སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། ཚངས་རིས་དང་། ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པ་ཀུན་འཁོར་དང་། ཚངས་ཆེན་དང་། སྣང་བ་དང་། ཆུང་སྣང་དང་། ཚད་མེད་སྣང་བ་དང་། ཀུན་སྣང་དང་བ་དང་། དགེ་བ་དང་། ཆུང་དགེ་དང་། ཚད་མེད་དགེ་བ་དང་།
en: Moreover, Śāradvatīputra, when bodhisattva great beings also think, ‘How is it that, diffusing from the soles of my feet marked with the motif of a thousand-spoked wheel one hundred billion trillion rays of light, I shall assuage all the sufferings associated with the states that lack freedom and the lower realms, and secure all beings in happiness?’

source: དགེ་རྒྱས་དང་། ཆེ་བ་དང་། ཆུང་ཆེ་དང་། ཚད་མེད་ཆེ་བ་དང་། འབྲས་བུ་ཆེ་བ་དང་། མི་ཆེ་བ་དང་།
en: they should train in the perfection of wisdom. “

source: མི་གདུང་བ་དང་། གྱ་ནོམ་སྣང་བ་དང་། ཤིན་ཏུ་མཐོང་བ་དང་། འོག་མིན་གྱི་ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མས་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་དུ་འགྲོ་བར་བྱ་སྙམ་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ།
en: Moreover, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, they should think, ‘How is it that I, surrounded and attended by the gods of the Caturmahā­rāja­kāyika realm and by many hundred billion trillion gods of the Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, Para­nirmita­vaśa­vartin, Brahmakāyika, Brahmapurohita, Brahma­pariṣadya, Mahābrahmā, Ābha, Parīttābha, Apramāṇābha, Ābhāsvara, Śubha, Parīttaśubha, Apramāṇaśubha, Śubhakṛtsna, Bṛhat, Parīttabṛhat, Apramāṇabṛhat, and Bṛhatphala realms, and those of the Pure Abodes Avṛha, Atapa, Sudṛśa, Sudarśana, and Akaniṣṭha, shall approach the Tree at the Seat of Enlightenment?’

source: འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ།
en: And when they think such thoughts, they should train in the perfection of wisdom. “

source: ཇི་ལྟར་ན་བདག་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་དུ་འདུག་པའི་ཚེ། རྒྱལ་པོ་ཆེན་པོ་བཞིའི་རིས་ཀྱི་ལྷ་དང་། སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། ཚངས་རིས་དང་། ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པ་ཀུན་འཁོར་དང་། ཚངས་ཆེན་དང་། སྣང་བ་དང་། ཆུང་སྣང་དང་།
en: Moreover, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, they should think, ‘How is it that when I approach the Tree at the Seat of Enlightenment a mat will be spread out for me by the gods of the Caturmahā­rāja­kāyika realm and the gods of Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, Para­nirmita­vaśa­vartin, Brahmakāyika, Brahmapurohita, Brahma­pariṣadya, Mahābrahmā.

source: ཚད་མེད་སྣང་བ་དང་། ཀུན་སྣང་བ་དང་། དགེ་བ་དང་། ཆུང་དགེ་དང་། ཚད་མེད་དགེ་བ་དང་། དགེ་རྒྱས་དང་། ཆེ་བ་དང་། ཆུང་ཆེ་དང་། ཚད་མེད་ཆེ་བ་དང་། འབྲས་བུ་ཆེ་བ་དང་། མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་། གྱ་ནོམ་སྣང་བ་དང་།
en: Ābha, Parīttābha, and Apramāṇābha; and those of Ābhāsvara, Śubha, Parīttaśubha, Apramāṇaśubha, Śubhakṛtsna, Bṛhat, Parīttabṛhat, Apramāṇabṛhat, and Bṛhatphala; and those of the Pure Abodes Avṛha, Atapa, Sudṛśa, Sudarśana, and Akaniṣṭha?’

source: ཤིན་ཏུ་མཐོང་བ་དང་། འོག་མིན་གྱི་ལྷ་རྣམས་སྟན་གདིང་བར་འགྱུར་སྙམ་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: And when they think such thoughts, they should train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཇི་ལྟར་ན་བདག་སྙིང་པོ་བྱང་ཆུབ་ལ་འདུག་སྟེ། མཚན་གྱིས་ལེགས་པར་བརྒྱན་པའི་ལག་གིས་ས་ཆེན་པོ་ལ་བརྡབས་ནས། ནག་པོའི་ཕྱོགས་བདུད་འཁོར་དང་བཅས་པ་ཤིན་ཏུ་ཕམ་པར་བྱ་སྙམ་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, they should think, ‘How is it that, seated at the seat of enlightenment, after touching the ground with my hand, excellently adorned with the major marks, I shall defeat the dark forces along with the entourage of Māra?’ And when they think such thoughts, they should train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཇི་ལྟར་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། འགྲོ་བ་དང་། འགྲེང་བ་དང་འདུག་པ་དང་།
en: Moreover, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, they should think, ‘How is it that, having attained consummate buddhahood in unsurpassed, complete enlightenment, I shall transform the places where I move, stand, sit, and recline to be of the nature of vajra?’

source: ཉལ་བའི་ས་ཕྱོགས་དེ་དག་རྡོ་རྗེའི་རང་བཞིན་དུ་འདུག་པར་འགྱུར་སྙམ་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: And when they think such thoughts, they should train in the perfection of wisdom. “
